In [1]:
# 23.05.27(토) 285~315
# 더미 변수 계산
import pandas as pd
import numpy as np

df = pd.DataFrame({'key': list('bbacab'), 'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [2]:
dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [3]:
df[['data1']].join(dummies)

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [4]:
val = np.random.randn(7)
val

array([-0.45752565,  0.24274062,  1.11128101,  0.62850837,  1.73473695,
       -0.43544675,  0.52528932])

In [5]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(val, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           0
1           0           1           0           0           0
2           0           0           0           0           0
3           0           0           0           1           0
4           0           0           0           0           0
5           0           0           0           0           0
6           0           0           1           0           0

In [6]:
# stack()과 unstack() 메소드로 재형성
tup = list(zip(*[['ha', 'ha', 'hi', 'hi', 'ho', 'ho', 'hu', 'hu'],
                 ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]))
ind = pd.MultiIndex.from_tuples(tup, names=['1st', '2nd'])
df = pd.DataFrame(np.random.randn(8, 2), index=ind, columns=['A', 'B'])
df1 = df[:4]
df1

                A         B
1st 2nd
ha  one  0.880494 -0.831090
    two  0.685878 -0.488223
hi  one -0.404974  0.966422
    two  0.172934 -0.710882

In [7]:
stacked = df1.stack()
stacked

1st  2nd
ha   one  A    0.880494
          B   -0.831090
     two  A    0.685878
          B   -0.488223
hi   one  A   -0.404974
          B    0.966422
     two  A    0.172934
          B   -0.710882
dtype: float64

In [8]:
type(stacked)

pandas.core.series.Series

In [9]:
stacked.unstack()

                A         B
1st 2nd
ha  one  0.880494 -0.831090
    two  0.685878 -0.488223
hi  one -0.404974  0.966422
    two  0.172934 -0.710882

In [10]:
stacked.unstack(1)

2nd         one       two
1st
ha  A  0.880494  0.685878
    B -0.831090 -0.488223
hi  A -0.404974  0.172934
    B  0.966422 -0.710882

In [11]:
stacked.unstack('1st')

1st          ha        hi
2nd
one A  0.880494 -0.404974
    B -0.831090  0.966422
two A  0.685878  0.172934
    B -0.488223 -0.710882

In [12]:
ind = pd.MultiIndex.from_product([[2, 1], ['a', 'b']])
df = pd.DataFrame(np.random.randn(4), index=ind, columns=['top'])
df

          top
2 a  0.272183
  b  0.230863
1 a -0.412972
  b  2.657499

In [13]:
df.unstack().stack()

          top
1 a -0.412972
  b  2.657499
2 a  0.272183
  b  0.230863

In [14]:
all(df.unstack().stack() == df.sort_index())

True

In [15]:
all(df.unstack().stack() == df)

ValueError: Can only compare identically-labeled DataFrame objects

In [16]:
# melt() 메소드로 재형성
df = pd.DataFrame({'first': ['Haena', 'Suho'],
                   'last': ['Kang', 'Chae'],
                   'age': [30, 18], 'score': [100, 85]})
df

   first  last  age  score
0  Haena  Kang   30    100
1   Suho  Chae   18     85

In [17]:
df.melt(id_vars=['first', 'last'])

   first  last variable  value
0  Haena  Kang      age     30
1   Suho  Chae      age     18
2  Haena  Kang    score    100
3   Suho  Chae    score     85

In [18]:
df.melt(id_vars=['first', 'last'], var_name='personal')

   first  last personal  value
0  Haena  Kang      age     30
1   Suho  Chae      age     18
2  Haena  Kang    score    100
3   Suho  Chae    score     85

In [20]:
# 5.1.4 파이썬 정규 표현식 사용하기
# 정규표현식 구문
import re
txt = "You + I am smart + (special)"
lst = re.findall('[+,()]', txt)
lst

['+', '+', '(', ')']

In [22]:
m = re.search('(?<=abc)def', 'abcdef')
m.group()

'def'

In [23]:
m = re.search('(?<=-)\w+', 'spam-egg')
m.group(0)

'egg'

In [24]:
# re모듈
re.compile(regex_pattern, flags=0) # regex_pattern 정해주면 정상작동 됨

NameError: name 'regex_pattern' is not defined

In [29]:
pattern = re.compile(regex_pattern) # regex_pattern 정해주면 정상작동 됨

NameError: name 'regex_pattern' is not defined

In [30]:
result = pattern.match(string) # 이런식으로 가능하다는 걸 보여주는 거암

NameError: name 'pattern' is not defined

In [31]:
re.search(regex_pattern, string, flags=0) # 이런식으로 가능하다는 걸 보여주는 거암

NameError: name 'regex_pattern' is not defined

In [32]:
txt = "The azalea is beautiful"
mat = re.search('^The.*ful$', txt)
mat

In [33]:
re.match(regex_pattern, string, flags) # 이런식으로 가능하다는 걸 보여주는 거암

NameError: name 'regex_pattern' is not defined

In [34]:
re.split(regex_pattern, string, maxsplit=0, flags=0) # 이런식으로 가능하다는 걸 보여주는 거암

NameError: name 'regex_pattern' is not defined

In [35]:
txt = "The azalea in Korea"
lst = re.split('\s', txt)
lst

['The', 'azalea', 'in', 'Korea']

In [36]:
type(lst)

list

In [38]:
lst1 = re.split('\s', txt, 2)
lst1

['The', 'azalea', 'in Korea']

In [39]:
re.split('\W+', 'Ha, hi, ho')

['Ha', 'hi', 'ho']

In [40]:
re.split('\W+', 'Ha, hi, ho.')

['Ha', 'hi', 'ho', '']

In [43]:
re.split('(\W+)', 'Ha, hi, ho. ')

['Ha', ', ', 'hi', ', ', 'ho', '. ', '']

In [42]:
re.split('\W+', 'Ha, hi, ho. ', 1)

['Ha', 'hi, ho. ']

In [44]:
re.split('[a-f]+', '0a3B7', flags=re.IGNORECASE)

['0', '3', '7']

In [45]:
re.findall(regex_pattern, string, flags=0) # 이런식으로 가능하다는 걸 보여주는 거암

NameError: name 'regex_pattern' is not defined

In [46]:
txt = "The azalea in Korea"
lst = re.findall('a', txt)
lst

['a', 'a', 'a', 'a']

In [47]:
o re.sub(regex_pattern, repal, string, count=0, flags=0) # 이런식으로 가능하다는 걸 보여주는 거암

SyntaxError: invalid syntax (3085589440.py, line 1)

In [48]:
txt = "The azalea in Korea"
str = re.sub('\s', '_', txt)
str

'The_azalea_in_Korea'

In [50]:
str1 = re.sub('\s', '_', txt, 2)
str1

'The_azalea_in Korea'

In [51]:
# 정규표현식 객체
Pattern.search(string[, pos[, endpos]]) # 이런식으로 가능하다는 걸 보여주는 거암

SyntaxError: invalid syntax (1731754305.py, line 2)

In [52]:
pattern = re.compile('e')
pattern.search('haena')

In [53]:
pattern.search('haena', 2)

In [55]:
pattern.search('haena', 3)

In [56]:
Pattern.match(string[, pos[, endpos]]) # 이런식으로 가능하다는 걸 보여주는 거암

SyntaxError: invalid syntax (1734030719.py, line 1)

In [57]:
pattern = re.compile('u')
pattern.match('naeun')

In [58]:
pattern.match('naeun', 3)

In [59]:
pattern.match('naeun',2 )

In [60]:
# Match 객체
mat = re.match(r'(\w+) (\w+) (\w+)', 'I love Korea')
mat.group(0)

'I love Korea'

In [61]:
mat.group(1)

'I'

In [62]:
mat.group(2)

'love'

In [63]:
mat.group(1, 3)

('I', 'Korea')

In [64]:
txt = "The azalea in Korea"
mat = re.search(r'\bK\w+', txt)
mat

In [65]:
mat.span()

(14, 19)

In [66]:
mat.string

'The azalea in Korea'

In [67]:
mat.group()

'Korea'

In [68]:
txt = 'smart jchae-justin@google.com expert'
mat = re.search(r'\w+@\w+', txt)
mat.group()

'justin@google'

In [69]:
mat1 = re.search(r'[\w+.-]+@[\w.-]+', txt)
mat1.group()

'jchae-justin@google.com'

In [70]:
txt2 = 'smart jchae-justin79@google.com expert'
mat2 = re.search(r'[a-zA-Z0-9.+-]+@[a-zA-Z]+\.com', txt2)
mat2.group()

'jchae-justin79@google.com'

In [71]:
mat3 = re.search(r'([\w.-]+)@([\w.-]+)', txt2)
mat3.group()

'jchae-justin79@google.com'

In [72]:
mat3.group(1)

'jchae-justin79'

In [73]:
mat3.group(2)

'google.com'

In [74]:
# 5.1.5 텍스트 데이터 가공하기
ser = pd.Series(['Suho', 'AA', np.nan, 'rabbit'])
type(ser.str)

pandas.core.strings.accessor.StringMethods

In [75]:
ser.str.lower()

0      suho
1        aa
2       NaN
3    rabbit
dtype: object

In [76]:
ser.str.upper()

0      SUHO
1        AA
2       NaN
3    RABBIT
dtype: object

In [77]:
ser.str.len()

0    4.0
1    2.0
2    NaN
3    6.0
dtype: float64

In [78]:
ind = pd.Index([' ha', 'hi ', ' ho ', 'hu'])
ind.str.strip()

Index(['ha', 'hi', 'ho', 'hu'], dtype='object')

In [79]:
ind.str.lstrip()

Index(['ha', 'hi ', 'ho ', 'hu'], dtype='object')

In [80]:
ind.str.rstrip()

Index([' ha', 'hi', ' ho', 'hu'], dtype='object')

In [87]:
df = pd.DataFrame(np.random.randn(2, 2), columns=[' Column A ', ' Column B '],
                 index=range(2))
df

    Column A    Column B
0   -0.739992   -0.355092
1   -0.931608   -0.131245

In [88]:
df.columns

Index([' Column A ', ' Column B '], dtype='object')

In [89]:
df.columns.str.strip()

Index(['Column A', 'Column B'], dtype='object')

In [90]:
df.columns.str.lower()

Index([' column a ', ' column b '], dtype='object')

In [91]:
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_')
df

   column_a  column_b
0 -0.739992 -0.355092
1 -0.931608 -0.131245

In [92]:
# 문자열을 분할하고 대체하기

ser1 = pd.Series(['ha_a_b', 'hi_c_d', np.nan, 'ho_e_f'])
ser1.str.split('_')

0    [ha, a, b]
1    [hi, c, d]
2           NaN
3    [ho, e, f]
dtype: object

In [93]:
ser1.str.split('_').str.get(1)

0      a
1      c
2    NaN
3      e
dtype: object

In [94]:
ser1.str.split('_').str[1]

0      a
1      c
2    NaN
3      e
dtype: object

In [95]:
ser1.str.split('_', expand=True)

     0    1    2
0   ha    a    b
1   hi    c    d
2  NaN  NaN  NaN
3   ho    e    f

In [96]:
ser = pd.Series(['Suho', 'bAAa', np.nan, 'cute_dog'])
ser

0        Suho
1        bAAa
2         NaN
3    cute_dog
dtype: object

In [97]:
ser.str.replace('^.a|dog', '***', case=False)

/var/folders/cx/r_wdv_3d2q7_cr1m0yrq3dph0000gn/T/ipykernel_1118/1278271741.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  ser.str.replace('^.a|dog', '***', case=False)

0        Suho
1       ***Aa
2         NaN
3    cute_***
dtype: object

In [98]:
import re
pattern = re.compile('^.a|dog', flags=re.IGNORECASE)
ser.str.replace(pattern, '***')

0        Suho
1       ***Aa
2         NaN
3    cute_***
dtype: object

In [99]:
# 텍스트 이어 붙이기

ser = pd.Series(['ha', 'hi', 'ho'])
ser.str.cat(sep=',')

'ha,hi,ho'

In [100]:
ser.str.cat()

'hahiho'

In [101]:
ser1 = pd.Series(['ha', np.nan, 'hi'])
ser1.str.cat(sep=',')

'ha,hi'

In [103]:
ser1.str.cat(sep=',', na_rep='*')

'ha,*,hi'

In [104]:
ser.str.cat(['A', 'I', 'O'])

0    haA
1    hiI
2    hoO
dtype: object

In [105]:
ser.str.cat(ser1)

0    haha
1     NaN
2    hohi
dtype: object

In [108]:
ser.str.cat(ser1, na_rep='*')

0    haha
1     hi*
2    hohi
dtype: object

In [109]:
df = pd.concat([ser1, ser], axis=1)
df

     0   1
0   ha  ha
1  NaN  hi
2   hi  ho

In [110]:
ser.str.cat(df, na_rep='*')

0    hahaha
1     hi*hi
2    hohiho
dtype: object

In [111]:
ser2 = pd.Series(['z', 'a', 'b', 'd'], index=[-1, 0, 1, 3])
ser2

-1    z
 0    a
 1    b
 3    d
dtype: object

In [112]:
ser

0    ha
1    hi
2    ho
dtype: object

In [113]:
ser.str.cat(ser2, join='left', na_rep='*')

0    haa
1    hib
2    ho*
dtype: object

In [114]:
ser.str.cat(ser2, join='outer', na_rep='*')

-1     *z
 0    haa
 1    hib
 2    ho*
 3     *d
dtype: object

In [115]:
# str로 인덱스 변경하기

ser = pd.Series(['Suho', 'AB', np.nan, 'rabbit', 'C'])
ser.str[0]

0      S
1      A
2    NaN
3      r
4      C
dtype: object

In [116]:
ser.str[1]

0      u
1      B
2    NaN
3      a
4    NaN
dtype: object

In [117]:
# 일기 형식의 텍스트 데이터 가공

day_plan = ["1st_seq: getting up at 05:45am",
            "2nd_seq: swimming from 06:00am to 07:00am",
            "3rd_seq: My morning food is American style",
            "4th_seq: Writting some proposal form 02:00pm to 06:00pm",
            "5th_seq: Arriving at JongGak at 07:00pm",
            "6th_seq: Fun with friends enjoying beer till 09:30pm",
            "7th_seq: My house at 10:30pm and sleeping by 12:00pm"]

df = pd.DataFrame(day_plan, columns=['schedule'])
df

                                            schedule
0                     1st_seq: getting up at 05:45am
1          2nd_seq: swimming from 06:00am to 07:00am
2         3rd_seq: My morning food is American style
3  4th_seq: Writting some proposal form 02:00pm t...
4            5th_seq: Arriving at JongGak at 07:00pm
5  6th_seq: Fun with friends enjoying beer till 0...
6  7th_seq: My house at 10:30pm and sleeping by 1...

In [118]:
df['schedule'].str.split()

0                 [1st_seq:, getting, up, at, 05:45am]
1     [2nd_seq:, swimming, from, 06:00am, to, 07:00am]
2    [3rd_seq:, My, morning, food, is, American, st...
3    [4th_seq:, Writting, some, proposal, form, 02:...
4       [5th_seq:, Arriving, at, JongGak, at, 07:00pm]
5    [6th_seq:, Fun, with, friends, enjoying, beer,...
6    [7th_seq:, My, house, at, 10:30pm, and, sleepi...
Name: schedule, dtype: object

In [119]:
df['schedule'].str.split().str.len()

0    5
1    6
2    7
3    8
4    6
5    8
6    9
Name: schedule, dtype: int64

In [120]:
df['schedule'].str.contains('My')

0    False
1    False
2     True
3    False
4    False
5    False
6     True
Name: schedule, dtype: bool

In [121]:
df['schedule'].str.count('\d')

0    5
1    9
2    1
3    9
4    5
5    5
6    9
Name: schedule, dtype: int64

In [122]:
df['schedule'].str.findall('\d')

0                [1, 0, 5, 4, 5]
1    [2, 0, 6, 0, 0, 0, 7, 0, 0]
2                            [3]
3    [4, 0, 2, 0, 0, 0, 6, 0, 0]
4                [5, 0, 7, 0, 0]
5                [6, 0, 9, 3, 0]
6    [7, 1, 0, 3, 0, 1, 2, 0, 0]
Name: schedule, dtype: object

In [123]:
df['schedule'].str.findall('(\d\d):(\d\d)')

0              [(05, 45)]
1    [(06, 00), (07, 00)]
2                      []
3    [(02, 00), (06, 00)]
4              [(07, 00)]
5              [(09, 30)]
6    [(10, 30), (12, 00)]
Name: schedule, dtype: object

In [124]:
df['schedule'].str.replace(r'(\w+_seq\b)', lambda x: x.groups()[0][0:3])

/var/folders/cx/r_wdv_3d2q7_cr1m0yrq3dph0000gn/T/ipykernel_1118/684965154.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df['schedule'].str.replace(r'(\w+_seq\b)', lambda x: x.groups()[0][0:3])

0                           1st: getting up at 05:45am
1                2nd: swimming from 06:00am to 07:00am
2               3rd: My morning food is American style
3    4th: Writting some proposal form 02:00pm to 06...
4                  5th: Arriving at JongGak at 07:00pm
5     6th: Fun with friends enjoying beer till 09:30pm
6     7th: My house at 10:30pm and sleeping by 12:00pm
Name: schedule, dtype: object

In [125]:
df['schedule'].str.extract('(\d\d):(\d\d)')

     0    1
0   05   45
1   06   00
2  NaN  NaN
3   02   00
4   07   00
5   09   30
6   10   30

In [126]:
df['schedule'].str.extractall('((\d?\d):(\d\d) ?([ap]m))')

               0   1   2   3
  match
0 0      05:45am  05  45  am
1 0      06:00am  06  00  am
  1      07:00am  07  00  am
3 0      02:00pm  02  00  pm
  1      06:00pm  06  00  pm
4 0      07:00pm  07  00  pm
5 0      09:30pm  09  30  pm
6 0      10:30pm  10  30  pm
  1      12:00pm  12  00  pm

In [128]:
dfx = df['schedule'].str.extractall('(?P<times>(?P<hr>\d\d):(?P<min>\d\d)?(?P<periods>[ap]m))')
dfx

           times  hr min periods
  match
0 0      05:45am  05  45      am
1 0      06:00am  06  00      am
  1      07:00am  07  00      am
3 0      02:00pm  02  00      pm
  1      06:00pm  06  00      pm
4 0      07:00pm  07  00      pm
5 0      09:30pm  09  30      pm
6 0      10:30pm  10  30      pm
  1      12:00pm  12  00      pm

In [129]:
dfx.index

MultiIndex([(0, 0),
            (1, 0),
            (1, 1),
            (3, 0),
            (3, 1),
            (4, 0),
            (5, 0),
            (6, 0),
            (6, 1)],
           names=[None, 'match'])

In [131]:
dfx.index = pd.MultiIndex(levels=[['one', 'two', 'three', 'four', 'five', 'six'],
                               ['1st', '2nd']],
                       codes=[[0, 1, 1, 2, 2, 3, 4, 5, 5], [0, 0, 1, 0, 1, 0, 0, 0, 1]],
                       names=['step', 'match'])

In [133]:
dfx

               times  hr min periods
step  match
one   1st    05:45am  05  45      am
two   1st    06:00am  06  00      am
      2nd    07:00am  07  00      am
three 1st    02:00pm  02  00      pm
      2nd    06:00pm  06  00      pm
four  1st    07:00pm  07  00      pm
five  1st    09:30pm  09  30      pm
six   1st    10:30pm  10  30      pm
      2nd    12:00pm  12  00      pm